app/views/posts/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."user_id" IS NULL
---

          <% User.where(:id => post.user_id).each do |row| %>