app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
    <%= @post.description %>
     <% User.where(:id => @post.user_id).each do |row| %>