app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    if current_user
      @user = current_user
      @post.user_id = @user.id
    end
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 21 Sep 2012 04:19:24 UTC +00:00], ["description", "Hello"], ["title", "Hello"], ["updated_at", Fri, 21 Sep 2012 04:19:24 UTC +00:00], ["user_id", 1]]